### Pandas

In [70]:
import pandas as pd
from pandas import Series, DataFrame

In [6]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [10]:
obj2 = pd.Series([4,7,-5,3], index = ["d","b","a","c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2["a"]

-5

In [18]:
obj2["d"] = 6
obj2[["c","a","d"]]

c    3
a   -5
d    6
dtype: int64

In [20]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [22]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [24]:
import numpy as np

In [26]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [28]:
"b" in obj2

True

In [30]:
"e" in obj2

False

In [34]:
sdata = {"Ohio" : 35000, "Texas": 71000, "Oregon": 16000, "Utah":5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [42]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [44]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [46]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [48]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [50]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [52]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [54]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [56]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [58]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [62]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [74]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [76]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [78]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [80]:
pd.DataFrame(data, columns = ["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [82]:
frame2 = pd.DataFrame(data, columns= ["year", "state", "pop","debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [84]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [86]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [90]:
frame2.loc[1] #second row

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [94]:
frame2.iloc[2] #third row

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [96]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [100]:
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [104]:
val = pd.Series([-1.2,-1.5, -1.7], index = ["two", "four", "five"])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [106]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [108]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [110]:
populations = {"Ohio":{2000: 1.5, 2001:1.7, 2002:3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [114]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [116]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [118]:
pdata = {"Ohio":frame3["Ohio"][:-1],
         "Nevada":frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [120]:
frame3.index.name = "year"
frame3.columns.name ="state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [122]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [124]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [126]:
obj = pd.Series(np.arange(3), index = ["a","b","c"])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [128]:
index[1:]

Index(['b', 'c'], dtype='object')

#### index

In [132]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [134]:
obj2 = pd.Series([1.5,-2.5,0], index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [136]:
obj2.index is labels

True

In [138]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [140]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [142]:
"Ohio" in frame3.columns

True

In [144]:
2003 in frame3.index

False

In [146]:
pd.Index(["foo", "foo", "bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

#### reindex

In [150]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index =["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [156]:
obj2 = obj.reindex(["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [158]:
obj3 = pd.Series(["blue","purple","yellow"], index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [164]:
obj3.reindex(np.arange(6), method ="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [170]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index =["a","c","d"],
                     columns = ["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [172]:
frame2 = frame.reindex(index = ["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [174]:
states = ["Texas","Utah","California"]
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [176]:
frame.reindex(states, axis = "columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [178]:
frame.loc[["a","d","c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [180]:
obj = pd.Series(np.arange(5.), index =["a","b","c","d","e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [184]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [186]:
obj.drop(["d","c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [188]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ["Ohio","Colorado", "Utah","New York"],
                    columns = ["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [190]:
data.drop(index = ["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [192]:
data.drop(columns = ["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [194]:
data.drop("two", axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [196]:
data.drop(["two","four"], axis= "columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [198]:
obj = pd.Series(np.arange(4.), index = ["a","b","c","d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [200]:
obj["b"]

1.0

In [202]:
obj[1]

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [204]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [206]:
obj[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [208]:
obj[[1,3]]

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [210]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [212]:
obj.loc[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [214]:
obj1 = pd.Series([1,2,3], index = [2,0,1])
obj2 = pd.Series([1,2,3], index = ["a","b","c"])
obj1

2    1
0    2
1    3
dtype: int64

In [216]:
obj2

a    1
b    2
c    3
dtype: int64

In [218]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [220]:
obj2[[0,1,2]]

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [222]:
obj2.loc[[0,1]]

KeyError: "None of [Index([0, 1], dtype='int32')] are in the [index]"

In [224]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [228]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [230]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [232]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [234]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index =["Ohio", "Colorado", "Utah", "New York"],
                    columns = ["one","two","three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [236]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [238]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [240]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [244]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [246]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [248]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [252]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [256]:
data.loc[["Colorado" , "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [260]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [262]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [264]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [266]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [268]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [270]:
data.loc[:"Utah","two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [272]:
data.iloc[:,:3][data.three >5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [274]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [276]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [282]:
ser2 = pd.Series(np.arange(3.), index = ["a","b","c"])
ser2[-1]

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\718233909.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [284]:
ser.iloc[-1]

2.0

In [286]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [290]:
data.loc[:,"one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [292]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [296]:
data.loc[data["four"] > 5 ] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [304]:
data.loc[data.three == 5]["three"] = 6 #issue occurs
data

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\2798030105.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6 #issue occurs

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [306]:
data.loc[data.three==5,"three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

####

In [311]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index = ["a", "c","d","e"])
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],
               index =["a","c","e","f","g"])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [313]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [315]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [321]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns = list("bcd"),
                   index =["Ohio","Texas","Coloradao"])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list("bde"),
                   index =["Utah","Ohio","Texas","Oregon"])

df1

             b    c    d
Ohio       0.0  1.0  2.0
Texas      3.0  4.0  5.0
Coloradao  6.0  7.0  8.0

In [323]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [325]:
df1 + df2

             b   c     d   e
Coloradao  NaN NaN   NaN NaN
Ohio       3.0 NaN   6.0 NaN
Oregon     NaN NaN   NaN NaN
Texas      9.0 NaN  12.0 NaN
Utah       NaN NaN   NaN NaN

In [327]:
df1 = pd.DataFrame({"A":[1,2]})
df2 = pd.DataFrame({"B":[3,4]})

df1

   A
0  1
1  2

In [329]:
df2

   B
0  3
1  4

In [331]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [337]:
df1 =pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns =list("abcd"))

df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns =list("abcde"))

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [339]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [341]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [343]:
df1.add(df2,fill_value =0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [345]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [347]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [349]:
df1.reindex(columns=df2.columns, fill_value =0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [351]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [353]:
arr[0]

array([0., 1., 2., 3.])

In [355]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [357]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                     columns=list("bde"),
                     index =["Utah","Ohio","Texas","Oregon"])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [359]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [364]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [366]:
series2 = pd.Series(np.arange(3), index=["b","e","f"])
series2

b    0
e    1
f    2
dtype: int32

In [368]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [370]:
series3 = frame["d"]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [372]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [374]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [376]:
frame = pd.DataFrame(np.random.standard_normal((4,3)),
                     columns=list("bde"),
                     index =["Utah","Ohio","Texas","Oregon"])
frame

               b         d         e
Utah    1.292808  0.673846 -0.312536
Ohio   -0.966994  0.659542 -1.295403
Texas   0.191148 -0.240738 -0.381820
Oregon  1.873591  1.314666  0.945046

In [378]:
np.abs(frame)

               b         d         e
Utah    1.292808  0.673846  0.312536
Ohio    0.966994  0.659542  1.295403
Texas   0.191148  0.240738  0.381820
Oregon  1.873591  1.314666  0.945046

In [380]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    2.840585
d    1.555403
e    2.240449
dtype: float64

In [382]:
frame.apply(f1, axis= "columns")

Utah      1.605344
Ohio      1.954944
Texas     0.572968
Oregon    0.928545
dtype: float64

In [384]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min","max"])

frame.apply(f2)

            b         d         e
min -0.966994 -0.240738 -1.295403
max  1.873591  1.314666  0.945046

In [386]:
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\2705683181.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah     1.29   0.67  -0.31
Ohio    -0.97   0.66  -1.30
Texas    0.19  -0.24  -0.38
Oregon   1.87   1.31   0.95

In [388]:
frame["e"].map(my_format)

Utah      -0.31
Ohio      -1.30
Texas     -0.38
Oregon     0.95
Name: e, dtype: object

In [390]:
obj = pd.Series(np.arange(4), index =["d","a","b","c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [392]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [394]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                     index =["three","one"],
                     columns = ["d","a","b","c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [396]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [398]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [400]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [402]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [404]:
obj = pd.Series([4,np.nan, 7, np.nan, -3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [406]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [408]:
frame = pd.DataFrame({"b":[4,7,-3, 2], "a": [0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [412]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [414]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [416]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [418]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [420]:
obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [428]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0,1,0,1],
                      "c": [-2,5,8,-2.5]})

frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [430]:
frame.rank(axis = "columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### overlapped index

In [433]:
obj = pd.Series(np.arange(5), index=["a","a","b","b","c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [435]:
obj.index.is_unique

False

In [437]:
obj["a"]

a    0
a    1
dtype: int32

In [439]:
obj["c"]

4

In [443]:
df = pd.DataFrame(np.random.standard_normal((5,3)),
                  index=["a","a","b","b","c"])
df

          0         1         2
a  0.058275  1.260210  0.526633
a  1.967924 -0.446896 -0.311316
b -0.874399  0.878808 -0.894398
b  0.727958 -0.375051  0.500943
c -0.734058 -0.465525 -0.138742

In [445]:
df.loc["b"]

          0         1         2
b -0.874399  0.878808 -0.894398
b  0.727958 -0.375051  0.500943

In [447]:
df.loc["c"]

0   -0.734058
1   -0.465525
2   -0.138742
Name: c, dtype: float64

In [449]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index = ["a","b","c","d"],
                  columns =["one", "two"])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [451]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [453]:
df.sum(axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [455]:
df.sum(axis ="index", skipna = False)

one   NaN
two   NaN
dtype: float64

In [457]:
df.sum(axis ="columns", skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [459]:
df.mean(axis = "columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [463]:
df.idxmax()

one    b
two    d
dtype: object

In [465]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [467]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [471]:
obj = pd.Series(["a","a","b","c"] *4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [493]:
price = pd.read_pickle(r"C:\Users\JuhyunN\Python for Data Analysis\yahoo_price.pkl")
volume = pd.read_pickle(r"C:\Users\JuhyunN\Python for Data Analysis\yahoo_volume.pkl")

In [495]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [497]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [499]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [501]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [503]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [505]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [507]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [513]:
obj = pd.Series(["c","a","d","a","a","b","b","c","c"])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [515]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [517]:
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [519]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [523]:
mask = obj.isin(["b","c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [525]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [529]:
to_match = pd.Series(["c", "a","b","b","c","a"])
unique_vals = pd.Series(["c","b","a"])
indices=pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [533]:
data = pd.DataFrame({"Qu1": [1,3,4,3,4],
                     "Qu2": [2,3,1,2,3],
                     "Qu3": [1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [537]:
data["Qu1"].value_counts().sort_index()
result = data.apply(pd.value_counts).fillna(0)
result

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_26168\2788322559.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [539]:
data = pd.DataFrame({"a": [1,1,1,2,2], "b": [0,0,1,0,0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [541]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64